Public Member Functions | Friends | List of all members
IFCAPI::Property Class Referencefinal
IFC Data Access
Represents an IfcProperty. More...
#include <IFCProperty.hpp>
 Inheritance diagram for IFCAPI::Property:
 Public Member Functions
GS::UniString  | GetPropertySetName () const
Name of the container IfcPropertySet.
GS::UniString  | GetName () const
Name of the IfcProperty.
PropertyByType  | GetTyped () const
Instance of the specific property type.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | PropertyAccessor
 class  | PropertyBuilder
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Represents an IfcProperty.
Since
Archicad 28